// 23.9 --- array-spilt.js
// const nums = [5, 9, 8, 7, 71, 76, 74, 87];
// const part = nums.slice(2, 5);     //slice     // 2 থেকে শুরু হবে আর 5 এর আগ পর্যন্ত চলতে থাকবে। যেই এরি টা প্রথমে থাকবে তা থেকে শুরুহবে এবং এর পরের যে এরের নাম্বার টা থাকবে তার আগের মান টা পর্যন্ত আসবে কিছুটা >5 েএই রকম মানে 5 লেখলে 4 পর্যন্ত চলবে।
// console.log(part);
// console.log(nums);   // এখানের নাম্বার গুলা slice করলে কোন পরিবর্তন হবেনা।



// const nums = [5, 9, 8, 7, 71, 76, 74, 87];
// const removed = nums.splice(2,5);  // splice  // এরের 2 নাম্বার থেকে শুরু হলে 5টা মান কে রাখবে। এখানে যদি প্রথমে 2 দেই এবং পরে 1 দদেই তাহলেও এইখান 2 নাম্বার এরে থেকে শুরু করে শুধু েএকটা নাম্বার নিবে।
// console.log(removed);
// console.log(nums)    // এখানের নাম্বার গুলা splice করলে কোন পরিবর্তন হবে উপরের যেই নাম্বার গুলাকে আমি রিমুভ করবো সেই নাম্বার গুলা রিমুভ হয়ে যাবে।         

// nums = [5, 9, 8, 7, 71, 76, 74, 87];
// const removed = nums.splice(2,5, 1111, 2222, 333);  // splice  // এরের 2 নাম্বার থেকে শুরু হলে 5টা মান কে রাখবে। এখানে যদি প্রথমে 2 দেই এবং পরে 1 দদেই তাহলেও এইখান 2 নাম্বার এরে থেকে শুরু করে শুধু েএকটা নাম্বার নিবে  । আবার প্রথম দুইটা সংখ্যা মানে হলো--- 1ম টা হলো এইটা থেকে শুরু করেবে। 2য় টা হলো এইটা যত লেখা আছে ততটা পর্যন্ত মান নিবে। 3য়-থেকে যত গুলাই লেখি ততগুলা সংখ্যা এই রিমুভ করা যায়গায় মেইন ফাংশনে বসবে। কিন্তু রিমুভ সুধু হবে প্রথম সংখ্যা 2য় সংখ্যা গুলাই।         
// console.log(removed);
// console.log(nums)    // এখানের নাম্বার গুলা splice করলে কোন পরিবর্তন হবে উপরের যেই নাম্বার গুলাকে আমি রিমুভ করবো সেই নাম্বার গুলা রিমুভ হয়ে যাবে।   এইখানে splice করা সংখ্যা গুলার পরের পার্টের সংখ্যা গুলা রিমুভকরা যায়গায় বসবে।



nums = [5, 9, 8, 7, 71, 76, 74, 87];
const together = nums.join("");      // join  //(", ") এইখানে লেখলে সবগুলা সংখ্যার পরে পরে একটা করে কমা চলে আসবে এবং কোনো এরের মধ্যে দেখাবেনা। আবার যদি (" এখানে যা লেখি তাই আসবে ")   মানে দুই টা সংখ্যার মাজে  
console.log(together);







