//23.10 break-continue.js
const nums = [1, 2, 2, 1, 3, 4, 2, 1, 7, 8, 9]
for (let i = 0; i < nums.length; i++) {
    if(nums[i]>3){   //  (nums[i]>3)  মানে আই এর কোন সংখ্যা যদি 3 এর সমান বা বড় হয় তাহলে সেখানেই ব্রেক করে ফেলবে  পরে যদি 3 এর সমান বা ছোট সংখ্যা থাকেও তাও সে সেখানে যেতে পারবেনা। সে প্রথম যেই 3 িএর বড় সংখ্যা  পাবে তখন থেকিই সে েব্রেক করে ফেলবে।  এখানে 3 এর পরি বর্তে যেকোন মান লেখা যাবে এবং এই মান গুলা হবে কিছুটা বিপরিত মুখি েএবং 3এর সমান থেকে। যদি না বুঝি তাহলে কনশল করে দেখলে কি্লায়ার হয়ে যাবো।
        break;
    }
    console.log(nums[i]);
}


// const nums = [1, 0, -2, 33, 4, -5, -6, 7, -8, 9]
// for (let i = 0; i < nums.length; i++) {
//     if(nums[i]<0){  // এখানে আই এর বেলু যদি  0 এ্রর বড় হয় তাহলে সেই সকল মান গুলা কনশল হবে। এইটা কিছু্টা উলটা সিস্টেম nums[i]<0   এইখানে 0 বা যে কোন সংখ্যা ‍যদি আমি ডিকলার করি তাহলে যেই সংখ্যা ডিকলার করা হইছে সেই সংখ্যা থেকে েশুরু করে এর উপরে যেই সংখ্যা গুলা পবে তাকে সিরিয়াল মত দেখািইতে থাকবে। ্ আবার যদি nums[i]>0 করি তাহলে আগের শর্ত মত 0 থেকে শুরু করে এর যত ছোট সংখ্যা গুলা আছে সিরিয়াল অনুযায়ী দেখাবে।     
//         continue;
//     }
//     console.log(nums[i]);
// }






