
// 23-3 ---null-vs-undefined
// let pakhi;       // যদি এইভাবে রাখি তাহলে আনডিফান্ট হবে। মানে এখানে যেহেতু কোন মান দেওয়া নাই তাই এইটাকে আনডিফাইন দেখাবে
// console.log(pakhi)  


// function add(num1, num2){
//     console.log(num1 + num2);   // এইটার মান আসবে 
//     return; // যদি ফাংশনের মান কে রিটান্ট না করি তাহলে তা আনডিফাইন্ট দেখাবে। আবার যদি সুধু রিটান্ট লেখি তাহলে কিন্তু কোন মানটা রিটান্ট করবো তা ডিফান্ট না করি তাহলে আনডিফান্ট মান আসবে । 
// }
// const result = add(13, 82); 
// console.log(result); // এ্টার মান আন ডিফান্ট আসবে কারন সেখান থেকে সুধু রিটান্ট লেখা আছে কি রিটান্ট করবে তা লেখা নািই


// function add(num1, num2){
//     console.log(num1, num2);  // 13 undefined
// }
// const result = add(13);
// console.log(result);  // undefined


// const premik = {name: "Hassan", phone: 25464156};
// console.log(premik.gf); // যেহেতু অবজেক্ট  এ gf এর বেলু দেওয়া নাই তাই আনডিফাইন্ট হবে 


// let fun = undefined;
// console.log(fun);     //  undefined

// নাল মানে হলো কোন কিছু নাই বা নন এজিস্ট বোঝায়। কিন্তু আনডিফাইন্ট হলো অনেক রকম করে আমরা বের করতে পারি। যেমন কোন একটা বেরিয়েবল না ডিকলার করা , কোন একটা অবজেক্ট না ডিকলার করে কনশল করলেও হবেনা। অনেক ভাবেই করা যায় কোন বেলু না্ এড করে তাকে কনশল করলেই ্আমরা সাধারনত আনডিফান্ট পেতে পারি।
