//23.7 --- scope.js   
// হুস্টিং হলো কোন একটা রেরিয়েবল উপরের দিকে নিয়ে যাওয়াকেই বলা হয় । িযদি কোন একটা বার আমি ডিকলার করি কিন্তু এর আগেই যদি আমি কনশল ডিকলার করি তাহলে তা আনডিফান্ট দিবে । িএর মানে বার এর বেলু টা উপরে যায়না বেরিয়েবল টাই সুধু উপরে যায়। কিন্তু কনস্ট বা লেট যদি আমি ব্যবহার করি তাহলে  আগে কিছুই পাওয়া যাবেনা।
let bonus = 20;
function sum(first, second){
    let result = first + second + bonus;
    // console.log(bonus);    // বিতর থেকে বাইরে বেরিয়েবল কনসল করা যাবে । কিন্ত বাহির থেকে বিতরের গুলাকে কল করা যাবেনা। বাইরে যে বেরিয়েবল গুলা থাকে তাদের যে কোন জায়গাথেকে  কল করা যায় কিন্তু বিতরে যেগুলা থাকে তা সবগুলা বিতরের কনশল করতে হবে।ে
    if(result > 9){
        let mood = 'happy';
        mood = 'lovely';
        mood = 'upSad'
        console.log(mood);  // বিতর থেকে বাইরে বেরিয়েবল কনসল করা যাবে । কিন্ত বাহির থেকে বিতরের গুলাকে কল করা যাবেনা। বাইরে যে বেরিয়েবল গুলা থাকে তাদের যে কোন জায়গাথেকে  কল করা যায় কিন্তু বিতরে যেগুলা থাকে তা সবগুলা বিতরের কনশল করতে হবে।ে
    }
    return result;
}
// কনস্ট বা লেট হলো বল্ক এটা { } এই টার বিতরেই সুধু থাকবে । আবার যদি কখনো কনশল আগে করি তাহলে এরোর দেখাবে কিন্তু বার যেকোন যায়গাথেকে্ে িকল করা হোক না কেনো সব সময়ই পাওয়া যাবে। যদি আগে কনশল করা হয় তাহলে আনডিফাইন্ট হবে।
const output = sum(3, 7);
console.log(output);






